In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[ 0.00958694,  0.94779712, -0.57986035],
       [-0.72876803,  2.43333726,  0.76888236],
       [-0.66280069, -1.77926957,  1.01104845],
       [-1.10261236, -0.55747954, -1.51153451]])

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
type(dataFrame[0])

pandas.core.series.Series

In [6]:
dataFrame

          0         1         2
0  0.009587  0.947797 -0.579860
1 -0.728768  2.433337  0.768882
2 -0.662801 -1.779270  1.011048
3 -1.102612 -0.557480 -1.511535

In [7]:
yeniDataFrame = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns = ["Maas","Yas","Calisma Saati"])

In [8]:

yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.009587  0.947797      -0.579860
Zeynep -0.728768  2.433337       0.768882
Atlas  -0.662801 -1.779270       1.011048
Mehmet -1.102612 -0.557480      -1.511535

In [9]:

yeniDataFrame["Yas"]

Atil      0.947797
Zeynep    2.433337
Atlas    -1.779270
Mehmet   -0.557480
Name: Yas, dtype: float64

In [10]:
yeniDataFrame["Calisma Saati"]

Atil     -0.579860
Zeynep    0.768882
Atlas     1.011048
Mehmet   -1.511535
Name: Calisma Saati, dtype: float64

In [11]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil    0.009587  0.947797
Zeynep -0.728768  2.433337
Atlas  -0.662801 -1.779270
Mehmet -1.102612 -0.557480

In [12]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.009587  0.947797      -0.579860
Zeynep -0.728768  2.433337       0.768882
Atlas  -0.662801 -1.779270       1.011048
Mehmet -1.102612 -0.557480      -1.511535